<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Document</title>
</head>
<body>
<?php
/**
 * Created by PhpStorm.
 * User: TMJoker
 * Date: 2016/4/21
 * Time: 19:10
 */
//假设，有5个灯泡需要管理，需要实现以下功能目标：
//1，可以指定任意一个灯泡的“当前状态”
//2，可以打开指定的任意一个灯泡
//3，可以关闭指定的任意一个灯泡

//首先，需要设定对应的5个常量，代表对应的5个灯泡：
define("D1",1);     //对应二进制值为：00000001
define("D2",2);     //对应二进制值为：00000010
define("D3",4);     //对应二进制值为：00000100
define("D4",8);     //对应二进制值为：00001000
define("D5",16);    //对应二进制值为：00010000

//然后定义一个变量，该变量就代表这5个灯泡的任意组合状态的值
$state = 10;        //其对应二进制值为00001010
                    //此时，它其实表示第2个和第4个灯亮

//任务1，可以指定任意一个灯泡的“当前状态”
//需求1a：请输出灯泡1的状态；

if(($state & D1)>0){
//逻辑分析：
//$state = 10，对应二进制值为：  00001010
//D1=1，对应二进制值为：         00000001
//                            &
//-------------------------------------
//                             00000000
//00000000代表全部灯灭。
//
//
    echo "<br />灯1是亮着";
}else{
    echo "<br />灯1是灭的";
}
//需求1b：请输出灯泡2的状态；
if(($state & D2)>0){
    echo "<br />灯2是亮着";
}else{
    echo "<br />灯2是灭的";
}


function ShowAll(){
    echo "<p>";
    for($i=1;$i<=5;++$i){
        $s = "D".$i;
        if(($GLOBALS['state'] & constant($s))>0){
            echo "灯{$i}亮着<br />";
        }else{
            echo "灯{$i}灭着<br />";
        }
    }
}
ShowAll();
?>
</body>
</html>
